# Project 6: Importing & Merging many files (Baby Names Dataset) - Part 2

# Project Brief for Self-Coders

Here you´ll have the opportunity to code major parts of Project 6 (Part 2) on your own. If you need any help or inspiration, have a look at the Videos or the Jupyter Notebook with the full code. <br> <br>
Keep in mind that it´s all about __getting the right results/conclusions__. It´s not about finding the identical code. Things can be coded in many different ways. Even if you come to the same conclusions, it´s very unlikely that we have the very same code.

## Getting the Files from the Web

1. __Go__ to https://catalog.data.gov/dataset/baby-names-from-social-security-card-applications-data-by-state-and-district-of- and __download__ and __unzip__ the file.

In [2]:
import pandas as pd
import numpy as np
import glob
import os

## Importing one File & Understanding the Data Structure

2. __Load__ the file __"AK.txt"__ into Pandas and __inspect__.

In [6]:
pd.read_csv("AK.txt", header = None, names = ["state", "gender","yob","name","count"])

      state gender   yob      name  count
0        AK      F  1910      Mary     14
1        AK      F  1910     Annie     12
2        AK      F  1910      Anna     10
3        AK      F  1910  Margaret      8
4        AK      F  1910     Helen      7
...     ...    ...   ...       ...    ...
28523    AK      M  2018      Theo      5
28524    AK      M  2018    Thorin      5
28525    AK      M  2018   Trenton      5
28526    AK      M  2018    Victor      5
28527    AK      M  2018      Zion      5

[28528 rows x 5 columns]

## The glob module

3. From glob import glob.

4. __Find__ all filenames with the structure __"A?.txt"__ in your current directory (? is a single charcter wildcard).

In [13]:
path = os.getcwd()
glob.glob(os.path.join(path, "A?.TXT"))

['/Users/jason1602/Documents/Python_project/Project_06_Materials/namesbystate/AR.TXT',
 '/Users/jason1602/Documents/Python_project/Project_06_Materials/namesbystate/AZ.TXT',
 '/Users/jason1602/Documents/Python_project/Project_06_Materials/namesbystate/AL.TXT',
 '/Users/jason1602/Documents/Python_project/Project_06_Materials/namesbystate/AK.TXT']

5. __Find__ all filenames with the following structure in your current directory and save the resulting list in a variable:

In [14]:
txt_files = glob.glob(os.path.join(path, "*.TXT"))# (* is a wildcard for zero or many characters)

# Importing & merging many Files (complex case)

6. __Load__ all files (*.txt) and __merge/concatenate__ all files into one Pandas DataFrame.

In [16]:
a = pd.read_csv(txt_files[0], header = None, names = ["state", "gender","yob","name","count"])
for f in txt_files[1:]:
    b = pd.read_csv(f, header = None, names = ["state", "gender","yob","name","count"])
    a = pd.concat([a,b])

In [17]:
a

      state gender   yob     name  count
0        IN      F  1910     Mary    619
1        IN      F  1910    Helen    324
2        IN      F  1910     Ruth    238
3        IN      F  1910  Dorothy    215
4        IN      F  1910  Mildred    200
...     ...    ...   ...      ...    ...
32308    DE      M  2018    Rocco      5
32309    DE      M  2018    Rylan      5
32310    DE      M  2018    Semaj      5
32311    DE      M  2018   Steven      5
32312    DE      M  2018   Thiago      5

[6028151 rows x 5 columns]

7. Create a __RangeIndex__ and __save__ the DataFrame (with columns "State", "Gender", "Year", "Name", "Count") in a new csv-file.

In [18]:
a.reset_index(drop = True, inplace =True)

In [22]:
a.gender.astype("category")
b.state.astype("category")

0        DE
1        DE
2        DE
3        DE
4        DE
         ..
32308    DE
32309    DE
32310    DE
32311    DE
32312    DE
Name: state, Length: 32313, dtype: category
Categories (1, object): [DE]

In [25]:
a.info

<bound method DataFrame.info of         state gender   yob     name  count
0          IN      F  1910     Mary    619
1          IN      F  1910    Helen    324
2          IN      F  1910     Ruth    238
3          IN      F  1910  Dorothy    215
4          IN      F  1910  Mildred    200
...       ...    ...   ...      ...    ...
6028146    DE      M  2018    Rocco      5
6028147    DE      M  2018    Rylan      5
6028148    DE      M  2018    Semaj      5
6028149    DE      M  2018   Steven      5
6028150    DE      M  2018   Thiago      5

[6028151 rows x 5 columns]>

In [19]:
#a.to_csv("")

        state gender   yob     name  count
0          IN      F  1910     Mary    619
1          IN      F  1910    Helen    324
2          IN      F  1910     Ruth    238
3          IN      F  1910  Dorothy    215
4          IN      F  1910  Mildred    200
...       ...    ...   ...      ...    ...
6028146    DE      M  2018    Rocco      5
6028147    DE      M  2018    Rylan      5
6028148    DE      M  2018    Semaj      5
6028149    DE      M  2018   Steven      5
6028150    DE      M  2018   Thiago      5

[6028151 rows x 5 columns]

# +++++++++ See some Hints below +++++++++++++

# ++++++++++++++++ Hints++++++++++++++++++++

__Hints for 2.__ <br>
You can use pd.read_csv(). You need to add appropriate column headers (e.g. "State", "Gender", "Year", "Name", "Count")

__Hints for 4. and 5.__<br>
Use glob()

__Hints for 6.__<br>
Use a for loop and pd.concat().